// app/terms/page.tsx

import { Card, CardContent } from "@/components/ui/card";


export const metadata = {
  title: "الشروط والأحكام - اكليل ابها",

  };

export default function TermsAndConditionsPage() {
  return (
    <div className="container mx-auto max-w-8xl p-8">
      <Card className="p-6 md:p-8">
        <header className="mb-8 text-center">
          <h1 className="text-4xl font-bold mb-2">الشروط والأحكام</h1>
          <p className="text-sm text-muted-foreground">آخر تحديث: 12/03/2025</p>
        </header>
        <CardContent>
          <section className="mb-10">
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              يمكنك الوصول إلى موقع اكليل ابها الإلكتروني{" "}
              <a
                href="https://www.ekleelabha.com"
                className="text-primary hover:underline font-semibold"
              >
                www.ekleelabha.com
              </a>{" "}
              عن طريق الإنترنت أو تطبيقات الهاتف المحمول.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              يتم تزويدك بالمحتوى والخدمات المتوفرة على موقع الويب وفقًا للشروط
              والأحكام وسياسة الخصوصية وغيرها من الشروط والسياسات التي تجدها من
              خلال موقعنا على الويب بشأن الوظائف أو الميزات أو العروض أو خدمات
              العملاء، وجميعها جزء من الشروط والأحكام ("الشروط العامة").
            </p>
            <p className="leading-relaxed text-sm md:text-base">
              يعد دخولك إلى الموقع أو استخدامه بمثابة إقرار منك بأنك قد قرأت هذه
              الأحكام والشروط ووافقت على الالتزام بها التزاما كاملا.
            </p>
          </section>

          <section className="mb-10">
            <h2 className="text-2xl font-semibold mb-4">الملكية الفكرية</h2>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              نحن نمنحك صلاحية شخصية غير قابلة للتحويل أو التنازل وقابلة للإلغاء
              لاستخدام البرامج التي نوفرها لك كجزء من الموقع الإلكتروني، وذلك
              لغرض واحد يتمثل في تمكينك من استخدام خدماتنا والتمتع بمزاياها،
              وهذا على النحو المقرر من قبل اكليل ابها ووفق الطريقة التي تسمح بها
              الشروط والأحكام.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              يحظر الاستخدام التجاري أو الاستخدام نيابةً عن الغير، ما لم نسمح
              بذلك صراحةً وخطيًا بصورة مسبقة. ويترتب على أي خرق لهذه الشروط
              والأحكام الإلغاء الفوري للرخصة الممنوحة بمقتضى هذه الفقرة دون سابق
              إنذار لك، ودون المساس بأي حقوق أخرى.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              جميع حقوق النشر والعلامات التجارية والأسماء التجارية والمظهر
              التجاري والتصميمات و&quot;سمات&quot; الموقع الإلكتروني وأي شكل من
              الأشكال الأخرى للملكية الفكرية والمواد والحقوق الأخرى المرتبطة
              بالموقع، بما في ذلك البرامج و كود HTML وغيره من الأكواد المستخدمة
              في الموقع الإلكتروني أو عناوين الصفحات أو الصور أو النصوص أو
              الرسوم التوضيحية أو التنسيقات أو الشعارات أو التصاميم أو الأيقونات
              أو الصور أو البرامج أو المقاطع الموسيقية أو التنزيلات أو مقاطع
              الفيديو (إجمالاً، "الملكية الفكرية")، تظل في جميع الأوقات ملكية
              وحقًا أصيلاً لاكليل ابها و/أو مالكيها، كما أنها محمية من قبل
              المملكة العربية السعودية وقوانين العلامات التجارية وحقوق التأليف
              والنشر الدولية.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              يجوز الوصول إلى الملكية الفكرية وجميع المواد الأخرى المعروضة على
              موقعنا الإلكتروني وعرضها وتنزيلها وطباعتها فقط للاستخدام الشخصي
              غير التجاري، وذلك حسبما تجيزه صراحةً اكليل ابها و/ أو المرخَّص لهم
              كأطراف ثالثة من جانب اكليل ابها.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              لكن بشرط : (1) ألا تجري أي تعديل أو تغيير على الملكية الفكرية بأي
              شكل من الأشكال.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              (2) أن لا تقدم أو تتيح الملكية الفكرية لأي طرف ثالث كنوع من
              التجارة، ولن تكتسب أي حق من حقوق التأليف والنشر أو العلامات
              التجارية أو غيرها من حقوق الملكية على الإطلاق فيما يتعلق بالملكية
              الفكرية، ولا يؤول لك أي ترخيص أو حق أو مصلحة في أي مواد أو برامج
              كأثر مترتب على استخدامك لهذا الموقع الإلكتروني أو على وصولك إلى
              الملكية الفكرية أو عرضها أو تنزيلها أو طباعتها.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              لا يجوز لك نسخ (باستثناء ما هو مبين أعلاه) أو نشر، أو بث أو توزيع
              أو عرض أو تعديل أو إنشاء أعمال مشتقة من أي من مواد الملكية الفكرية
              أو من موقعنا الإلكتروني أو بيعها أو المشاركة في أي بيع أو
              استغلالها بأي شكل من الأشكال، سواء كليًا أو جزئيًا.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              لايجوز استخدام الملكية الفكرية إلا باعتبارها مورد للتسوق، ويُمنَع
              منعًا باتًا أي استخدام آخر للملكية الفكرية، بما في ذلك نسخها، أو
              تعديلها أو توزيعها أو بثها أو إعادة نشرها أو عرضها أو أدائها.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              اكليل ابها هي المالك الخاص للملكية الفكرية (حسب مقتضى الحال)،
              والمرخَّص لها بشكل خاص لإسم النطاق.
              <a
                href="https://www.ekleelabha.com"
                className="text-primary hover:underline font-semibold"
              >
                www.ekleelabha.com
              </a>
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              يجوز لاكليل ابها أن توفر محتوى مملوكًا لأطراف ثالثة ("محتوى أطراف
              ثالثة") أو روابط لمواقع إلكترونية لأطراف ثالثة ("مواقع أطراف
              ثالثة") كخدمة للمهتمين بهذه المعلومات.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              لا تراقب اكليل ابها أي محتوى لأطراف ثالثة أو مواقع أطراف ثالثة ولا
              تصدِّق على محتواها وليس لديها أي سيطرة عليها، ولا يعني إدراج روابط
              لمحتوى أطراف ثالثة أو لمواقع أطراف ثالثة وجود أي ارتباط أو علاقة
              بين اكليل ابها والأطراف الثالثة ذات الصلة.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              لا تضمن اكليل ابها أو تقِّر بدقة أو كمال أي محتوى أطراف ثالثة أو
              أي مواقع أطراف ثالثة ولا تصادق على مدى دقتها أو كمالها.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              اكليل ابها ليست مسؤولة عن تحديث أو مراجعة محتوى الأطراف الثالثة أو
              مواقع الأطراف الثالثة، ويكون استخدامك لمحتوى الأطراف الثالثة
              ومواقع الأطراف الثالثة على مسؤوليتك، ولايعكس بالضرورة محتوى
              الأطراف الثالثة، بما في ذلك تعليقات مستخدمي محتوى الأطراف الثالثة
              التي تتلقاها اكليل ابها، آراء اكليل ابها الخاصة.
            </p>
            <p className="leading-relaxed text-sm md:text-base">
              في ضوء ما سبق، لن تتحمل اكليل ابها المسؤولية لأي سبب كان عن محتوى
              الأطراف الثالثة و/أو مواقع الأطراف الثالثة، ويشمل ذلك ولا يقتصر
              على توفير مصادر خارجية، أو المحتوى، أو الإعلانات التجارية أو
              المنتجات أو الخدمات أو أي معلومات أو بيانات أخرى متوفرة على الموقع
              الإلكتروني أو من مصادر خارجية.
            </p>
          </section>

          <section className="mb-10">
            <h2 className="text-2xl font-semibold mb-4">الخصوصية</h2>
            <p className="leading-relaxed text-sm md:text-base">
              الرجاء مراجعة سياسة الخصوصية لدينا لمعرفة تفاصيل حول ممارساتنا
              بشأن المعلومات الشخصية.
            </p>
          </section>

          <section className="mb-10">
            <h2 className="text-2xl font-semibold mb-4">شروط البيع</h2>
            <h3 className="text-xl font-semibold mb-2">1\ الأهلية</h3>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              شراء المنتجات من خلال الموقع الإلكتروني مقصور حصرياً على الأطراف
              الذين يمكنهم قانوناً إبرام عقود على الإنترنت وفقاً لقوانين المملكة
              العربية السعودية.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              حتى يمكنك إجراء عمليات الشراء على الموقع الإلكتروني، يجب عليك
              تقديم بياناتك الشخصية، بما في ذلك اسمك وأسم عائلتك الصحيح ورقم
              هاتف جوال صحيح وعنوان بريد إلكتروني سليم وتفاصيل الدفع وعنوان
              صحيح، لتحصيل الفواتير والمعلومات الأخرى المطلوبة وفق ما هو مقرر.
              كما أنك تقر وتضمن بأن تفاصيل الدفع التي تقدمها سارية وكاملة
              وصحيحة، وتؤكد على أنك الشخص المشار إليه في معلومات الفواتير
              المقدمة.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              الموقع الإلكتروني متوفر فقط للأشخاص الذين يستوفون شروط اكليل ابها
              بشأن الأهلية والدفع الالكتروني، وهم أولئك الذين يحملون بطاقة
              ائتمان سارية المفعول صادرة من مصرف مقبول لدى اكليل ابها، وأولئك
              الذين أذنوا لنا بإجراء خصم من بطاقات الائتمان الخاصة بهم لقيمة
              السعر الإجمالي للمنتجات التي يتم شراؤها، بما في ذلك أي ضرائب أو
              رسوم توصيل إن وجدت.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              المنتجات التي تُشترى تكون للاستخدام الشخصي أو لتقديمها كهدية فقط،
              ولا يجوز إعادة بيعها أو استخدامها لأغراض تجارية أو لتحقيق أي مكاسب
              تجارية أخرى. وتحتفظ اكليل ابها بالحق في فرض قيود على الكميات
              المتعددة من قطعة بعينها والتي تُشحن إلى عميل أو عنوان واحد بعينه.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              عندما تطلب شراء منتج (منتجات)، فإنك بذلك تأذن صراحةً لاكليل ابها
              بالتحقق من بطاقة الائتمان وبنقل أو إرسال أو الحصول على معلومات
              بطاقة الائتمان الخاصة بك أو معلومات التقارير الائتمانية، بما في
              ذلك أي معلومات محدَّثة، إلى أو من أطراف ثالثة للمصادقة على هويتك
              والتحقق من صحة بطاقتك الائتمانية وللحصول على التفويض الأولي
              باستخدام البطاقة و/أو إجازة عمليات الشراء الفردية، وذلك حسبما نراه
              ضرورياً. وتُعد موافقاً على أنه يجوز لنا استخدام المعلومات الشخصية
              التي تقدمها لغرض إجراء عمليات التحقق اللازمة لمكافحة الاحتيال
              والغش، وأنه يجوز الكشف عن هذه المعلومات الشخصية لمرجع ائتماني أو
              لوكالة معنية بمكافحة الاحتيال والغش، والتي قد تحتفظ بسجل لتلك
              المعلومات.
            </p>
            <p className="leading-relaxed text-sm md:text-base">
              يُرجى الرجوع إلى سياسة الخصوصية الخاصة بنا للحصول على المعلومات
              المتعلقة بكيفية استخدامنا للبيانات الخاصة بك.
            </p>

            <h3 className="text-xl font-semibold mb-2 mt-6">2\ طلب المنتجات</h3>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              المنتجات المتوفرة على الموقع الإلكتروني، بما في ذلك أي عينات أو
              هدايا مع عمليات الشراء قد تعرضها اكليل ابها عليك، هي للاستخدام
              الشخصي أو للهدايا فقط. ولا يجوز لك بيع أو إعادة بيع أي منتجات يتم
              شراؤها أو تحصل عليها بأي طريقة أخرى خلاف ذلك من اكليل ابها.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              قد يكون هناك اختلاف بسيط في تصميم الشكل الخارجي "العبوة - الكرتون"
              للمنتج المُستلم من قبل العميل وصورة عرضه في موقع اكليل ابها وذلك
              بسبب إصدار تصميم أحدث للعبوة أو الكرتون الخارجي للمنتج من قبل
              الشركة المُصنعة، ولكن، ذلك لا يعني اختلاف محتوى المنتج، واكليل
              ابها يضمن لكم ذلك ويسعى دائماً لتحديث وتجديد صور عرض المنتجات بشكل
              دوري.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              تخضع المنتجات المعروضة للبيع على الموقع الإلكتروني للقبول ومدى
              التوفر، وفي حال لم نتمكن لأي سبب من الأسباب عقب وضع طلب لمنتج
              (منتجات)، من توفير منتج معين، سنُبلغك في أقرب وقت ممكن وسنقوم
              بإلغاء طلبك بالكامل.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              تخضع جميع الطلبات للقبول ونحتفظ بالحق في رفض أو إلغاء الطلب لأي
              سبب من الأسباب، بما في ذلك عدم الدقة أو وجود أخطاء في المنتج أو في
              معلومات التسعير أو عدم تمكننا من الحصول على إذن بتحصيل الثمن أو
              لوجود قيود على التوصيل تنطبق على قطعة بعينها أو لأن القطعة
              المطلوبة لا تفي بمعايير مراقبة الجودة التي نطبقها ويجري سحبها، أو
              لأنك لا تفي بمعايير الأهلية المنصوص عليها في الشروط والأحكام أو
              بسبب أي مشكلة أخرى نكتشفها.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              تحتفظ اكليل ابها بسجل للمعاملات الخاصة بك لمدة معقولة لا تقل عن
              عشر سنوات.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              بعد إتمام الطلب الخاص بك ستصلك رسالة نصية شاكرين فيها تسوقك من
              اكليل ابها وستصلك رسالة على بريدك الالكتروني بتفاصيل طلبك.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              يجوز لنا رفض معالجة معاملة ما لأي سبب من الأسباب وكذلك يجوز لنا
              رفض الإرسال لأي شخص في أي وقت وفقاً لتقديرنا الحصري والمطلق، ولن
              نتحمل مسؤولية تجاهك أو تجاه أي طرف ثالث عن سحبنا لأي منتج، بما في
              ذلك أي عينات أو هدايا مع عمليات الشراء من الموقع الإلكتروني سواء
              بِيع أو لم يُبع هذا المنتج، كما لا نتحمل أي مسؤولية عن حذفنا، أو
              اختبارنا أو تدقيقنا أو تحريرنا لأي مواد أو محتوى على الموقع
              الإلكتروني، أوعن رفضنا معالجة معاملة ما، أو عن إبطال أو تعليق أي
              معاملة بعد الشروع في عملية المعالجة.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              نبذل كل ما في وسعنا للتأكد من دقة جميع التفاصيل الواردة على الموقع
              الإلكتروني، ومع ذلك قد نكتشف من وقت لآخر خطأ في أسعار المنتجات. في
              حال اكتشفنا وجود خطأ في سعر منتج مُدرَج في طلبك، سنقوم بإبلاغك في
              أقرب وقت ممكن، ولن نكن ملزمين بقبول أو تنفيذ طلب لمنتج أُعلن عنه
              بسعر غير صحيح ونحتفظ بالحق في إلغاء هذا الطلب الذي قُبل بالفعل أو
              الذي يكون في طريقه إليك، وفي حال طلبك منتجاً يحمل سعراً خاطئاً،
              سوف نرسل رسالة بريد إلكتروني لك أو نتصل بك هاتفياً لإبلاغك بأننا
              لم نقبل طلبك و/ أو بأن طلبك قد أُلغي، وفي حال قد دفعت بالفعل ثمن
              المنتج (المنتجات)، سوف نقوم برد المبلغ كاملاً في أقرب وقت ممكن،
              وفي حال استرجاع تلك المنتجات وهي في طريقها إليك، سنقوم بمعالجة
              عملية رد المبلغ إليك بمجرد استلامنا للمنتجات.
            </p>
            <p className="leading-relaxed text-sm md:text-base">
              بتأكيد عملية الشراء الخاصة بك في نهاية معالجة الطلب، يكون ذلك
              موافقة منك على قبول ودفع كامل المبلغ المستحق عن المنتج (المنتجات)
              على النحو المبين في طلبك، بما في ذلك أي رسوم توصيل تسري على هذا
              الطلب.
            </p>

            <h3 className="text-xl font-semibold mb-2 mt-6">
              3\ الأسعار وسياسة الدفع
            </h3>
            <p className="leading-relaxed mb-2 font-semibold">طرق الدفع:</p>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>الدفع عند الاستلام داخل السعودية.</li>
              <li>البطاقة الائتمانية (فيزا - مدى - ماستركارد).</li>
              <li>آبل باي.</li>
              <li>تمارا.</li>
              <li>تابي.</li>
              <li>STCPAY.</li>
            </ul>

            <p className="leading-relaxed mb-2 font-semibold">الأسعار:</p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              تشمل الأسعار ضريبة القيمة المضافة المطبقة في يوم الطلب، وأي تغيير
              في نسبة ضريبة القيمة المضافة المطبقة سوف ينعكس تلقائياً على سعر
              المنتجات التي تطرحها اكليل ابها للبيع على موقعها.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              بعض المنتجات لدينا غير خاضعة للضرائب بحسب نظام هئية الزكاة
              والضريبة والجمارك وبحسب نظام الهيئة العامة للغداء والدواء (الأدوية
              البشرية والفيتامينات والأجهزة الطبية والمنتجات الطبية المسجلة لدى
              الهيئة العامة للغذاء والدواء)
            </p>

            <p className="leading-relaxed mb-2 font-semibold">
              ضريبة القيمة المضافة:
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              الأسعار تشمل ضريبة القيمة المضافة المطبقة في يوم طلبك، وأي تغيير
              في نسبة ضريبة القيمة المضافة المطبقة سوف ينعكس تلقائياً في سعر
              المنتجات التي تباع من قبل اكليل ابها عن طريق موقعها الالكتروني.
            </p>

            <p className="leading-relaxed mb-2 font-semibold">رقم الضريبة:</p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              310534949600003
            </p>

            <p className="leading-relaxed mb-4 text-sm md:text-base">
              تخضع جميع أشكال الدفع عن طريق بطاقات الائتمان لعمليات تحقق من صحة
              البيانات وتفويض من قبل جهة إصدار البطاقة، وإذا رفضت جهة إصدار
              بطاقة الائتمان الإذن بالدفع، لن نتحمل مسؤولية عن أي تأخير أو عدم
              التسليم، وسوف نقوم بإلغاء طلبك وقد نقوم بالاتصال بك لاختيار طريقة
              بديلة للدفع.
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              يجب أن تطابق البيانات الواردة على بطاقة الائتمان المستخدمة في
              الدفع مع معلومات حامل بطاقة الائتمان بالضبط، تلك المعلومات المسجلة
              لدى جهة إصدار البطاقة. سيتم الموافقة على الدفع ووضعه في الانتظار
              عند تقديم طلبك وسوف يُخصم المبلغ من حسابك عند انتهاء اكليل ابها من
              ارسال طلبك. كما أنك تؤكد على أن بطاقة الائتمان المستخدمة هي بطاقتك
              أو على أنه قد تم الإذن لك تحديداً من قبل مالك بطاقة الائتمان
              باستخدامها.
            </p>
            <p className="leading-relaxed text-sm md:text-base">
              لن تُخزن أي بيانات لبطاقات ائتمان أو تباع أو تُعرض أو تُؤجر لأي
              أطراف ثالثة باستثناء ما يتعلق بمقدم خدمة بوابة الدفع عبر الإنترنت
              الذي نستعين به.
            </p>

            <h3 className="text-xl font-semibold mb-2 mt-6">4\ التوصيل</h3>
            <p className="leading-relaxed mb-2 font-semibold">
              الشحن داخل السعودية:
            </p>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>
                تتولى اكليل ابها توصيل المنتجات داخل المملكة العربية السعودية،
                في مدة يتم تحديدها اثناء اتمام الطلب، بدءاً من اليوم الذي يتم
                تأكيد طلبك فيه عبر رسالة البريد الإلكتروني اعتمادا على منطقتك.
              </li>
              <li>
                يُرجى العلم أنه قد يكون هناك تأخير في توصيل الطلبات أيام العروض
                وموسم التخفيضات.
              </li>
              <li>
                هناك رسوم شحن تضاف على اجمالي الطلب علماً بأن رسوم الشحن غير
                ثابته وقد تكون مجانية حسب العروض القائمة.
              </li>
              <li>
                يتم توصيل الطلبات من يوم السبت إلى الخميس، باستثناء يوم الجمعة
                والعطلات الرسمية.
              </li>
              <li>
                اكليل ابها تتعاون مع شركات شحن عالمية ومحلية، وتنتقل مسؤولية
                الشحنة بعد خروج الطلب من اكليل ابها إلى شركة الشحن.
              </li>
            </ul>

            <p className="leading-relaxed mb-2 font-semibold">
              الشحن خارج السعودية:
            </p>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>
                قد تختلف رسوم الجمارك من حين لآخر حسب سياسة الجمارك التابعة لكل
                دولة.
              </li>
              <li>يتم شحن الطلبات الدولية بالتعاون مع شركة ارامكس.</li>
              <li>
                لا يتم تحصيل قيمة الضريبة المضافة في السعودية على الطلبات
                الدولية.
              </li>
              <li>
                الإجمالي الظاهر في الطلب هو مبلغ المنتجات ورسوم الشحن، وأي مبالغ
                إضافية يتم تحصيلها عن طريق الجمارك بعد الشحن غير تابعة لاكليل
                ابها.
              </li>
            </ul>
            <p className="leading-relaxed mb-2 font-semibold">
              بإمكانك الاطلاع على تفاصيل الجمارك لكل دولة:
            </p>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>
                <span className="font-semibold">الكويت:</span> الجمارك: الختم 1
                دينار كويتي + 2 دينار كويتي رسوم التخليص الجمركي + رسوم اتحاد
                النقل الجوي الدولي + التصريح الجمركي 5% من القيمة الإجمالية
                للشحن.
                <ul className="list-circle list-inside mt-1">
                  <li>
                    رسوم اتحاد النقل الجوي الدولي: تعتمد على الوزن والمصدر، ولا
                    توجد ضريبة على القيمة المضافة.
                  </li>
                </ul>
              </li>
              <li>
                <span className="font-semibold">الإمارات:</span> إذا كانت قيمة
                الفاتورة 1000 درهم إماراتي وما فوق تخضع للرسوم الجمركية 5%
                وضريبة القيمة المضافة 5%.
                <ul className="list-circle list-inside mt-1">
                  <li>
                    هناك 5% ضريبة القيمة المضافة المطبقة بين 100 درهم و999 درهم
                    إماراتي.
                  </li>
                </ul>
              </li>
              <li>
                <span className="font-semibold">البحرين:</span> أعلى من 300
                دينار بحريني كقيمة الفاتورة الإجمالية، سيكون 5% جمارك + ضريبة
                القيمة المضافة 5%.
                <ul className="list-circle list-inside mt-1">
                  <li>ادنى من 300 دينار لا تخضع لاي رسوم.</li>
                </ul>
              </li>
              <li>
                <span className="font-semibold">عمان:</span> جميع الشحنات تخضع
                للرسوم.
                <ul className="list-circle list-inside mt-1">
                  <li>
                    اعلى من 300 ريال عماني قيمة الشحنات ستكون 5% على إجمالي قيمة
                    الفاتورة + رسوم على البيان الجمركي لكل شحنة.اقل من 300 ريال
                    عماني فقط 5% على اجمالي الفاتورة .
                  </li>
                </ul>
              </li>
              <li>
                <span className="font-semibold">قطر:</span> اعلى من 3000 ريال
                قطري سيكون هناك رسوم جمركية 5% +20 ريال قطري على البيان الجمركي.
                <ul className="list-circle list-inside mt-1">
                  <li>
                    اقل من 3000 ريال قطري هناك 20 ريال قطري على البيان الجمركي.
                  </li>
                </ul>
              </li>
            </ul>
            <p className="leading-relaxed text-sm md:text-base">
              وفي حال تم احتساب المبالغ الجمركية على الشحنة يتم التواصل مع شركة
              أرامكس 920027447 لأي استفسار أو توضيح.
            </p>

            <h3 className="text-xl font-semibold mb-2 mt-6">
              6\ سياسة الإلغاء
            </h3>
            <p className="leading-relaxed mb-2 font-semibold">الإلغاء:</p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              ندرك تماماً أنه في بعض الأحيان قد تغير رأيك بخصوص الشراء، فإذا
              غيرت رأيك قبل استلام طلبك، ما عليك سوى الدخول إلى موقعنا أو
              التطبيق واتباع الخطوات التاليه لالغاء الطلب: الدخول إلى حسابي
              &gt;طلباتي &gt; حدد الطلب &gt; إلغاء الطلب، شريطة الا يكون تم شحن
              الطلب. وايضاً يمكنكم إلغاء الطلب من خلال التواصل مع فريق خدمة
              العملاء على الرقم الموحد: 920033385، وسنبذل قصارى جهدنا في حدود
              المعقول لإلغائه. وفي حال شحن الطلب يجب التواصل مع خدمة العملاء
              للالغاء وسوف نتعامل مع الإلغاء باعتباره إرجاعاً.
            </p>

            <h3 className="text-xl font-semibold mb-2 mt-6">
              6/ العروض وكوبون الخصم
            </h3>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              اكليل ابها تقدم عروض وكوبونات تقديراً منها لعملائها الدائمين.
            </p>
            <p className="leading-relaxed mb-2 font-semibold">كوبون الخصم:</p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              جميع أكواد الخصم في اكليل ابها تشمل المنتجات المخفضة وغير المخفضة،
              مع مراعاة الشروط الخاصة بكل كود.
            </p>
            <p className="leading-relaxed mb-2 font-semibold">عملاء STC:</p>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>
                تقديراً من اكليل ابها لعملاء stc يمكنهم الدفع بنقاط قطاف وجمعها
                من خلال كل عملية شراء:
              </li>
              <li>
                يحصل عملاء التميز في stc على خصم بنسبة الخصم 15% ويشمل المنتجات
                الغير مخفضة فقط.
              </li>
              <li>
                يتم إكتساب نقطة لكل 10 ريال مع كل عملية شراء بعد استلام العميل
                للطلب.
              </li>
              <li>
                يتم استبدال نقاط قطاف برصيد دائم في محفظة اكليل ابها ويتم
                استرجاع قيمة الخصم إذا تم استرجاع/ إلغاء الطلب.
              </li>
              <li>
                استخدام مكافأة نقاط قطاف يلغي أي خصومات أو عروض على الطلب (مثل
                خصم الكوبون - عرض حبه وحبه مجانا وغيرها).
              </li>
            </ul>
            <p className="leading-relaxed mb-2 font-semibold">
              عملاء بنك الراجحي:
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              تقديراً من اكليل ابها لعملاء الراجحي يمكنهم استبدال النقاط برصيد
              دائم في المحفظة من خلال كل عملية شراء ويتم استرجاع قيمة الخصم إذا
              تم استرجاع/ إلغاء الطلب.
            </p>
            <p className="leading-relaxed mb-2 font-semibold">
              تقديم الهدايا والمبالغ المالية:
            </p>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              اكليل ابها تقدّم الهدايا والمبالغ المالية كجزء من تقديرها لعملائها
              الأعزاء، ويرجى ملاحظة أن المدة المتوقعة لإرسال هذه الهدايا أو
              المبالغ المالية المقدّمة ضمن الفعاليات التسويقية، تتراوح من
              أسبوعين إلى شهرين. نحن نسعى دائمًا لتقديم أفضل تجربة ممكنة ونقدّر
              تفهمكم لأي تأخير قد يحدث نتيجة لظروف خارجة عن إرادتنا.
            </p>

            <h3 className="text-xl font-semibold mb-2 mt-6">7/ رصيد المحفظة</h3>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>
                هو مبلغ مالي خاص بالعميل يمكنه الاستفادة منه كاملاً في عمليات
                الشراء القادمة.
              </li>
              <li>
                في حال وصول منتج تالف يتم تعويض العميل بمبلغ مالي في المحفظة
                بقيمة الضرر الحاصل بعد التواصل مع خدمة العملاء.
              </li>
              <li>
                يمكنك الحصول على رصيد من خلال الإهداءات أو رصيد من عروض اكليل
                ابها.
              </li>
              <li>
                رصيد التعويض والإهداءات غير محدد بمدة معينة، بينما رصيد عروض
                اكليل ابها يكون بمدة محددة حسب مدة العرض القائم.
              </li>
              <li>
                عند إتمام الطلب من قبل العميل يتم خصم كامل المبلغ الموجود في
                المحفظة فوراً مع أي طلب ومن ثم يتم دفع المبلغ المتبقي من قِبل
                العميل بأحد طرق الدفع المتاحة (فيزا، آبل باي، دفع عند الاستلام
                أو تمارا).
              </li>
            </ul>

            <h3 className="text-xl font-semibold mb-2 mt-6">
              8/ تقديم الشكاوى و المقترحات
            </h3>
            <p className="leading-relaxed mb-4 text-sm md:text-base">
              يمكن للعملاء تقديم الشكاوى أو المقترحات من خلال عدة قنوات سواء عن
              طريق الموقع الإلكتروني أو البريد الإلكتروني أو الهاتف أو عن طريق
              خانة التعليقات في الموقع الإلكتروني أو من خلال وسائل التواصل
              الإجتماعي (تويتر، انستقرام، وغيرها..).
            </p>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>
                <span className="font-semibold">الموقع الإلكتروني:</span> عن
                طريق القيام بإنشاء تذكرة شكوى عبر موقعنا الإلكتروني.
              </li>
              <li>
                <span className="font-semibold">البريد الإلكتروني:</span> عن
                طريق إرسال بريد إلكتروني إلى{" "}
                <a
                  href="mailto:CS@ekleelabha.com"
                  className="text-primary hover:underline"
                >
                  CS@ekleelabha.com
                </a>{" "}
                فيما يخص الشكاوى، و{" "}
                <a
                  href="mailto:Info@ekleelabha.com"
                  className="text-primary hover:underline"
                >
                  Info@ekleelabha.com
                </a>{" "}
                فيما يخص الاقتراحات.
              </li>
              <li>
                <span className="font-semibold">الهاتف:</span> عن طريق الاتصال
                على رقم الهاتف (+966920033385).
              </li>
              <li>
                <span className="font-semibold">وسائل التواصل الاجتماعي:</span>{" "}
                عن خلال إرسال الرسائل الخاصة.
              </li>
            </ul>

            <h3 className="text-xl font-semibold mb-2 mt-6">9/ نظام التذاكر</h3>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>
                حرصاً منا على إرضاء العميل وتقوية طرق التواصل بالطريقة السليمة،
                أطلقنا نظام التذاكر مما يسمح للعميل بإرسال تذكرة من خلال الطلب
                في حال رغب العميل بالتواصل مع فريق خدمة عملاء اكليل ابها.
              </li>
              <li>
                بإمكان العميل إرسال تذكرة من خلال الدخول على (طلباتي &gt; صفحة
                الطلب &gt; لدي مشكلة في الطلب &gt; اختيار العنوان &gt; وصف
                المشكلة وإرفاق صورة من المشكلة إن وجد).
              </li>
              <li>يتم البدء في التواصل مع العميل خلال 24 ساعة.</li>
              <li>
                لا يمكن للعميل إرسال أكثر من تذكرة في حال وجود تذكرة مفتوحة على
                نفس الطلب.
              </li>
              <li>
                على العميل اختيار العنوان الصحيح وكتابة التفاصيل مع شرح سبب
                التواصل وإرفاق صورة في حال تطلب الأمر ليسهل على خدمة العملاء حل
                المشكلة مباشرة.
              </li>
              <li>
                سوف يتم تنبيه العميل في حال وجود تحديث من فريق خدمة عملاء اكليل
                ابها عبر إشعارات التطبيق والبريد الإلكتروني.
              </li>
              <li>
                يتم إغلاق التذكرة بعد حل المشكلة ويتم تنبيه العميل بإغلاقها.
              </li>
              <li>
                تغلق التذكرة تلقائياً في حال عدم وجود رد من العميل خلال 72 ساعة.
              </li>
            </ul>

            <h2 className="text-2xl font-semibold mb-4 mt-6">أحكام متفرقة</h2>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>
                نحن نحتفظ بالحق في تعديل هذه الشروط والأحكام في أي وقت دون سابق
                إنذار لك، وتسري أي تعديلات على هذه الشروط والأحكام بمجرد نشرها
                على موقعنا الإلكتروني، ويعني استمرارك في استخدام الموقع
                الإلكتروني (أو أي من مواقعنا الإلكترونية الأخرى) بعد إجراء تغيير
                من هذا القبيل موافقتك على الالتزام بالشروط والأحكام المعدلة.
                يُرجى قراءة الشروط والأحكام والاطلاع عليها مراراً وتكراراً، وفي
                حال لم تكن موافقاً على أي تغيير في الشروط والأحكام، يجب عليك
                التوقف فوراً عن استخدام الموقع الإلكتروني.
              </li>
              <li>
                تشكل هذه الشروط والأحكام كامل الاتفاق القانوني بينك وبين اكليل
                ابها، وتحكم وتنظم استخدامك للموقع الإلكتروني وجميع الخدمات
                والمنتجات المتاحة عليه، وتحل تماماً محل أي اتفاقيات سابقة بينك
                وبين اكليل ابها فيما يتعلق بالغرض نفسه.
              </li>
              <li>
                أنت تقر وتوافق على أنه قد يتغير شكل وطبيعة الخدمات من وقت لآخر
                دون إشعار مُسبق لك، ويجوز لاكليل ابها التوقف عن تقديم الخدمات
                (أو عن تقديم أي ميزات مُضمَّنة فيها) لك أو للمستخدمين.
              </li>
              <li>
                أنت تتفهم وتدرك أن اكليل ابها تمنح مشغلي محركات البحث العامة
                الإذن باستخدام الشبكات العنكبوتية لنسخ مواد من الموقع للغرض
                الوحيد المتمثل في إنشاء مؤشرات بحث متوفرة للجمهور تتضمن المواد،
                وتحتفظ اكليل ابها بالحق في إلغاء هذه الاستثناءات، سواء بوجه عام
                أو في حالات محددة.
              </li>
              <li>
                أنت تتفهم وتدرك أنك وحدك المسؤول (وأن اكليل ابها ليست مسؤولة
                تجاهك أو تجاه أي طرف ثالث) عن أي خرق لالتزاماتك بموجب الشروط
                والأحكام وعن النتائج المترتبة (بما في ذلك أي خسارة أو ضرر قد
                تتكبده اكليل ابها ) على أي خرق من هذا القبيل.
              </li>
              <li>
                لا يجوز تفسير عدم ممارسة أو إنفاذ اكليل ابها، أو تأخرها في
                ممارسة أو إنفاذ أي حق أو سبيل انتصاف قانوني على أنه تنازل رسمي
                عن حقوق اكليل ابها.
              </li>
              <li>
                أنت واكليل ابها متعاقدان مستقلان، وهذه الشروط والأحكام بما يشمل
                على سبيل المثال لا الحصر تقديم، أو نقل أو بث أو توزيع المحتوى
                الخاص بك، سواء كلياً أو جزئياً، لا تشكلان علاقة شراكة أو مشروعاً
                مشتركاً أو عملاً أو امتيازاً أو وكالة بينك وبين اكليل ابها، ولن
                يكون لأي طرف من الطرفين سلطة إلزام الطرف الآخر أو تحميله
                التزامات نيابةً عنه بدون موافقة خطية مُسبقة من الطرف الآخر، وكلا
                الطرفين غير مفوَّض بالتصرف كوكيل أو ممثل للطرف الآخر أو نيابةً
                عن الطرف الآخر بأي صفة أخرى غير منصوص عليها صراحةً في الشروط
                والأحكام، ولا يجوز لأي طرف (أو لأي من وكلائه) التصريح بأنه يمثل
                الطرف الآخر أو مخولاً للتصرف كممثل له أو اعتبار نفسه ممثلاً له،
                كما لا يجوز لأي طرف أن يحمِّل الطرف الآخر أي مسؤولية أو التزام
                نيابةً عنه أو باسمه، ما لم ينص على ذلك تحديداً في هذه الشروط
                والأحكام.
              </li>
              <li>
                إذا ثبت أن أي نص من نصوص هذه الشروط والأحكام غير قانوني أو غير
                قابل للتنفيذ، لا تتأثر الشروط والأحكام الأخرى وتظل نافذة وسارية
                المفعول تماماً.
              </li>
              <li>
                هذه الشروط والأحكام متوفرة باللغتين الإنجليزية والعربية. وفي حال
                وُجد أي تعارض بين النص الإنجليزي والنص العربي، يسود النص العربي.
              </li>
              <li>
                تخضع هذه الشروط والأحكام لقوانين المملكة العربية السعودية، وتخضع
                جميع المنازعات التي تنشأ عن إنفاذ هذه الأحكام والشروط للاختصاص
                القضائي الحصري لمحاكم المملكة العربية السعودية.
              </li>
            </ul>

            <h2 className="text-2xl font-semibold mb-4 mt-6">حقوقك</h2>
            <p className="leading-relaxed mb-2 font-semibold">
              بيانات الحساب الشخصي:
            </p>
            <ul className="list-disc list-inside space-y-1 mb-4 text-sm md:text-base">
              <li>
                لدى العميل الأحقية في حذف أو إيقاف حسابه لدى اكليل ابها في أي
                وقت.
              </li>
              <li>
                بإمكان العميل حذف حسابه لدى اكليل ابها في حال عدم وجود بيانات
                مشتركة بين اكليل ابها والعميل مثل وجود طلبات سابقة، وفي حال وجود
                بيانات مشتركة بإمكان العميل إيقاف حسابه لدى اكليل ابها.
              </li>
              <li>
                ويتم ذلك من خلال التواصل معنا عبر البريد الالكتروني{" "}
                <a
                  href="mailto:cs@ekleelabha.com"
                  className="text-primary hover:underline"
                >
                  cs@ekleelabha.com
                </a>
              </li>
              <li>
                إذا كان لديك أي أسئلة حول الشروط والأحكام أو أي جانب من جوانب
                النظام الخاص بك، نرجو منك التواصل معنا عبر البريد الالكتروني{" "}
                <a
                  href="mailto:cs@ekleelabha.com"
                  className="text-primary hover:underline"
                >
                  cs@ekleelabha.com
                </a>
                .
              </li>
            </ul>
          </section>
        </CardContent>
      </Card>
    </div>
  );
}
